Revit 2027 API
BuiltInFailures.DimensionFailures.CannotDragWitnessLine Property
 Moving the Witness Line conflicts with other Constraints in the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDragWitnessLine { get; }
Public Shared ReadOnly Property CannotDragWitnessLine As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDragWitnessLine {
	FailureDefinitionId^ get ();
}
static member CannotDragWitnessLine : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace